Tekla Open API Reference for Tekla Structures 2025
RebarGroup.Polygons Property
 An array list of polygons to define the reinforcing bar group shape. Use 1 polygon when defining non-tapered or spiral rebar groups. Use 2 to 99 polygons when defining tapered rebar groups. Each polygon must have an equal number of points.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList Polygons { get; set; }
Public Property Polygons As ArrayList
	Get
	Set
Property Value
Type: ArrayList
See Also
Reference
RebarGroup Class
Tekla.Structures.Model Namespace